Repository: marcos-lacerda/url-shortener-flutter
Catalog: lib/l10n/app_*.arb
Languages: pt, pt_br

# appTitle
source: Link Shortener
pt: Encurtador de Links
pt_br: Encurtador de Links

# ls_inputHint
source: Paste or type a URL
pt: Cole ou digite uma URL
pt_br: Cole ou digite uma URL

# ls_emptyState_title
source: No links yet
pt: Nenhum link ainda
pt_br: Nenhum link ainda

# ls_emptyState_message
source: You haven't shortened any links yet. Start now!
pt: Você ainda não encurtou nenhum link. Comece agora mesmo!
pt_br: Você ainda não encurtou nenhum link. Comece agora mesmo!

# ls_errorInvalidUrl
source: Please enter a valid URL
pt: Informe uma URL válida
pt_br: Informe uma URL válida

# ls_list_title
source: Recently shortened URLs
pt: URLs encurtadas recentemente
pt_br: URLs encurtadas recentemente

# errorNetwork
source: No internet connection. Please check your network and try again.
pt: Sem ligação à internet. Verifique a sua rede e tente novamente.
pt_br: Sem conexão com a internet. Verifique sua rede e tente novamente.

# errorTimeout
source: The request took too long. Please try again.
pt: O pedido demorou demasiado tempo. Tente novamente.
pt_br: A requisição demorou demais. Tente novamente.

# errorCancelled
source: The request was canceled. Please try again.
pt: O pedido foi cancelado. Tente novamente.
pt_br: A requisição foi cancelada. Tente novamente.

# errorBadRequest
source: We couldn't process your request. Please review the information and try again.
pt: Não foi possível processar o seu pedido. Reveja a informação e tente novamente.
pt_br: Não foi possível processar sua solicitação. Revise as informações e tente novamente.

# errorUnauthorized
source: You don’t have permission to perform this action.
pt: Não tem permissão para realizar esta ação.
pt_br: Você não tem permissão para realizar esta ação.

# errorNotFound
source: We couldn’t find what you’re looking for.
pt: Não encontrámos o que procura.
pt_br: Não encontramos o que você procura.

# errorServer
source: The service is currently unavailable. Please try again later.
pt: O serviço está indisponível de momento. Tente novamente mais tarde.
pt_br: O serviço está indisponível no momento. Tente novamente mais tarde.

# errorHttpUnexpectedStatus
source: Unexpected response from the server.
pt: Resposta inesperada do servidor.
pt_br: Resposta inesperada do servidor.

# errorMalformedResponse
source: We received an unexpected response format.
pt: Recebemos um formato de resposta inesperado.
pt_br: Recebemos um formato de resposta inesperado.

# errorMissingFieldUrl
source: The server response is missing the URL field.
pt: A resposta do servidor não contém o campo de URL.
pt_br: A resposta do servidor não contém o campo de URL.

# errorUnexpected
source: Something went wrong. Please try again.
pt: Ocorreu um erro. Tente novamente.
pt_br: Algo deu errado. Tente novamente.

# errorUnexpectedWithDetail
source: Something went wrong
pt: Ocorreu um erro
pt_br: Algo deu errado:

# errorInvalidUrlEmpty
source: Please enter a URL.
pt: Introduza um URL.
pt_br: Informe uma URL.

# errorInvalidUrlFormat
source: The URL format is invalid.
pt: O formato do URL é inválido.
pt_br: O formato da URL é inválido.

# errorInvalidUrlScheme
source: The URL must start with http:// or https://
pt: O URL deve começar por http:// ou https://
pt_br: A URL deve começar com http:// ou https://

# errorInvalidUrlHostEmpty
source: The URL must contain a valid host.
pt: O URL deve conter um host válido.
pt_br: A URL deve conter um host válido.

# errorInvalidUrlDomain
source: The URL domain seems invalid.
pt: O domínio do URL parece inválido.
pt_br: O domínio da URL parece inválido.

# errorInvalidUrlLocalhost
source: Local URLs are not allowed.
pt: URLs locais não são permitidas.
pt_br: URLs locais não são permitidas.

# errorInvalidUrlLength
source: The URL length is invalid.
pt: O tamanho do URL é inválido.
pt_br: O tamanho da URL é inválido.

# errorOpenUrlFailed
source: Could not open the URL
pt: Não foi possível abrir o URL
pt_br: Não foi possível abrir a URL
